{
    "yaniktissera": {
        "username": "yaniktissera",
        "full_name": "Yanik Tissera",
        "biography": "Wildlife & Conservation Photographer\n@parrotfishcollective \nCo-founder \n@saltyswamis",
        "external_url": "https://vimeo.com/723601178?embedded=true&source=vimeo_logo&owner=178985773",
        "followers_count": 5250,
        "follows_count": 959,
        "is_verified": false,
        "posts_count": 118,
        "profile_pic_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-19/295621815_198035245895239_7296382178451587764_n.jpg?stp=dst-jpg_e0_s150x150_tt6&_nc_ht=scontent-iad3-1.cdninstagram.com&_nc_cat=107&_nc_oc=Q6cZ2QEOdVrXOrD_r6Rr5GyWk5aCFRYiZJbK2nnIY_CZ0CvQGoRLt6AThzcp85MVgYAzgI8SZNVb4hf8hqkR-6ht4TV7&_nc_ohc=89t7Nj8XdUUQ7kNvwF4mLzK&_nc_gid=FdGnY4swlFYTelaLiv9Oag&edm=AOQ1c0wBAAAA&ccb=7-5&oh=00_AfJyIw7mquqKE9jfZMMXi-PrThAEdgyPquP3AQ3JTnkGig&oe=6820AE8E&_nc_sid=8b3546",
        "business_category": "",
        "country": "Other",
        "processed_at": "2025-05-07 09:12:06",
        "posts": [
            {
                "id": "sc_DHNFdn_IFki",
                "shortcode": "DHNFdn_IFki",
                "caption": "Every four to six weeks, we return to the cameras high up in the mountains to check what images may have been made. At times, we get unlucky; equipment malfunctions, adverse weather, dead batteries, curious monkeys, and ravenous ants are just a few of the persistent troubles to be dealt with. Most of the time there is an image to salvage, however, all of the time, the adventures to these landscapes make up for the occasional disappointment. \n\nIn this video, I set up and retrieve a recent shot aimed at situating wildlife against a recognisable mountainscape. There is never a shortage of surprises as various creatures and beautiful landscapes present themselves anew at every visit. \n\nWatch till the end for a sneak peek of some results!\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 244,
                "comments_count": 25,
                "timestamp": "2025-03-15T03:14:03.000Z",
                "display_url": "https://scontent-atl3-3.cdninstagram.com/v/t51.2885-15/484339855_18473093695071717_3241063496541255340_n.jpg?stp=dst-jpg_e15_tt6&_nc_ht=scontent-atl3-3.cdninstagram.com&_nc_cat=109&_nc_oc=Q6cZ2QEV2yyArfjzZEmNqe-PYYnC-Kiv1EJviBsO8KcL0lI4CtDr80FuvgE_mO0Xfzv5cYs&_nc_ohc=G9UDRdM6zNoQ7kNvwG9UogB&_nc_gid=weB4MUUrni_GTDAbFmS9Sg&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfJbj6IFH4LfiAKBanEzVkYsyDXhPtY7C120uWb2p3kj2w&oe=6820AC31&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DHNFdn_IFki.jpg",
                "engagement_rate": 5.123809523809523,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ]
            },
            {
                "id": "sc_DCx5Dx5o41C",
                "shortcode": "DCx5Dx5o41C",
                "caption": "With the last remaining sub-montane and montane rainforests and one of the world’s richest concentrations of biodiversity that include an extremely high number of endemic species (many of which are site-endemic), the Central Highlands of Sri Lanka are truly a special place and as such represented in the UNESCO World Heritage List. \n\nDuring the drier months of the year (January - March), Sri Lanka’s mountain region is at high risk of fires. Determined by low humidity, topography and wind patterns during the short fire season of the wet zone, fires pose a danger to the mountain regions that are already vulnerable to climate change and environmental degradation. \n\nIt is the Eucalyptus, pine forests and grasslands that are especially prone, with many of these trees located on (inaccessible) steep slopes adjacent to tea estates, and the forest patches that are of significant importance. \n\nEven though the Central and Uva provinces are classified as having a “low fire risk”, raging fires and plumes of smoke rising from the sides of cliff faces are a common occurrence during the drier periods, always threatening pristine wilderness spaces close by. \n\nPictured here, a waterfall cascades into the Maussakelle reservoir as a wildfire burns at the bottom of a tea estate, sending clouds of smoke into the air against the backdrop of Sri Pada and the Peak Wilderness Sanctuary in the distance. \n\n#yaniktissera",
                "likes_count": 220,
                "comments_count": 3,
                "timestamp": "2024-11-25T03:38:52.000Z",
                "display_url": "https://instagram.fosu2-2.fna.fbcdn.net/v/t51.29350-15/467822835_1284636899394388_5420492457579462276_n.jpg?stp=dst-jpg_e35_s1080x1080_tt6&_nc_ht=instagram.fosu2-2.fna.fbcdn.net&_nc_cat=104&_nc_oc=Q6cZ2QHrDF7Vfx3rlovQJU88YEVVSMa_ZvjihRlwQ8icZdwI1il-H-7zy8lz-3L6JeQAkjFXNzKvyqxJVJoMvVKDW_eY&_nc_ohc=Mk7tzbn5ug8Q7kNvwFj18RK&_nc_gid=_Xd_kaTJS245oRo0EVk80g&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfIr6VbTYPliN7Ve5RLLah2EHM4x5hm0pE6GMdR2XvJByw&oe=6820C39D&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DCx5Dx5o41C.jpg",
                "engagement_rate": 4.247619047619048,
                "hashtags": [
                    "yaniktissera"
                ]
            },
            {
                "id": "sc_DGXEpQgIYuZ",
                "shortcode": "DGXEpQgIYuZ",
                "caption": "A self-portrait with a few visitors at our last location - these types of images are always a bonus for me if the particular photograph that was envisioned doesn’t work out. (It did). \n\nAs the camera records multiple moments over time, we are able to creatively piece together a surreal image, showcasing shared spaces of numerous species. \n\nWhat’s particularly special about this one is the little Leopard on the left. He/She is one of Arnold’s cubs. For those of you who have been following along - we found them! \n\nTwo healthy little cubs roughly 8 months old are now roaming around with their mother as she teaches them how to navigate this tricky environment against the iconic backdrop of the Sri Pada mountainscape; each species in this image fair game (except me), as the cubs learn the ways of an apex predator.\n\nThis image was made by combining 7 images taken over a period of 6 weeks. The species seen here include the Black-naped hare, Rusty-spotted cat, Indian crested porcupine, Ring-tailed civet, and Sri Lankan leopard. \n\nFollow along to see footage of those cubs, soon!\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 2745,
                "comments_count": 89,
                "timestamp": "2025-02-22T03:46:11.000Z",
                "display_url": "https://scontent-lga3-2.cdninstagram.com/v/t51.2885-15/481393418_18469057333071717_5793949617993902811_n.jpg?stp=dst-jpg_e35_s1080x1080_sh0.08_tt6&_nc_ht=scontent-lga3-2.cdninstagram.com&_nc_cat=109&_nc_oc=Q6cZ2QEev2Vw4j-n9kXpyQFAWcBHc4Pwg7_9uMJzcINbyVyIFJBOjOkIQyBR2ZP0IJzYNBc&_nc_ohc=2lM2LBo7I3AQ7kNvwH1QcO8&_nc_gid=XwDgnztg1YDB-aBQzCRAFw&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfIrlQV5mZgTFSmzk3OXH0uvzQ2ho4x0jFBzzrrrRThNKg&oe=6820931E&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DGXEpQgIYuZ.jpg",
                "engagement_rate": 53.98095238095239,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ]
            },
            {
                "id": "sc_DHIKa2hIGVk",
                "shortcode": "DHIKa2hIGVk",
                "caption": "Mountainscapes in silver.\n\nSunlight pierces through a gentle fog early one morning in the mountains of Sri Lanka. First light illuminates tea slopes whilst townships stir quietly in the shadow of the valleys. \n\n#yaniktissera",
                "likes_count": 222,
                "comments_count": 4,
                "timestamp": "2025-03-13T05:19:25.000Z",
                "display_url": "https://scontent-atl3-3.cdninstagram.com/v/t51.2885-15/483936481_18472659412071717_8140314694791428170_n.jpg?stp=dst-jpg_e15_fr_s1080x1080_tt6&_nc_ht=scontent-atl3-3.cdninstagram.com&_nc_cat=109&_nc_oc=Q6cZ2QHpWd8xg3MiEAddLjd30nWvOpo-ztk35QFyxi5Nu0_C5-dgTZrkNyHggw8-pAmmq5FgbnKyrtfFUwq0fnewthZN&_nc_ohc=du473KPVwu4Q7kNvwFOAbKB&_nc_gid=3dsvXfcFCnCqlMx5UMH-0A&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfJnhCwQ_QCj01kZ-69GZJ345hOHVcUmQ0zqwMgj4GXNHw&oe=6820C4AC&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DHIKa2hIGVk.jpg",
                "engagement_rate": 4.304761904761905,
                "hashtags": [
                    "yaniktissera"
                ]
            },
            {
                "id": "sc_C2YcGU3oCcs",
                "shortcode": "C2YcGU3oCcs",
                "caption": "A sacred mountain \nLit at its peak\nAwaiting pilgrims\nAnswers they seek\n\nA journey made\nTo concur terrain\nSpiritual growth\nOne seeks to attain \n\nA sacred footprint \nLeft after dark \nOut of sight \nI leave my mark\n\nDays before Sri Pada (Adams Peak) was declared open for the season, a leopard strolled past my camera. There was an error in my understanding - the mountain weather only becomes favourable after the full moon of December (which also marks the opening of the Sri Pada season). What was I doing trying to tick off a previsualised shot at the wrong month of the year? \n\nI was aware of the opportunities to capture iconic images in the highlands - ones that are unique and showcase the co-existence of humans and leopards in the central highlands of Sri Lanka, despite the issue of snaring. Whilst humans navigate these landscapes during the day, the islands’ terrestrial apex predators comfortably traverse the same paths after dark. \n\nI may not have captured the perfect image, but I am glad to have ticked off one from my growing list of images that will help tell this story. No doubt it is particularly rewarding considering what a beautifully clear night it was when this individual decided to come by, and despite all the odds, I am proud to have made an image of a Leopard with the Sri Pada mountainscape alight as the backdrop.\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 1330,
                "comments_count": 82,
                "timestamp": "2024-01-22T00:08:03.000Z",
                "display_url": "https://scontent-atl3-2.cdninstagram.com/v/t51.29350-15/420049069_244799338569479_5639597184815317462_n.jpg?stp=dst-jpg_e35_s1080x1080_tt6&_nc_ht=scontent-atl3-2.cdninstagram.com&_nc_cat=111&_nc_oc=Q6cZ2QE8KWmOmP4YnEq3CCcVWzBZQpYBIbgAYXpXzwHkwGo3ozpbrz0IMGhLe4q39NLzlWk&_nc_ohc=JuhyYz0sPJgQ7kNvwHcwZUT&_nc_gid=E18KRRIKR-sTzo08nuImXA&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfJxJuIitmmUmFAUK1uu1YQEPbK1fpNkOHuglVUzfXfVRg&oe=682096F3&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_C2YcGU3oCcs.jpg",
                "engagement_rate": 26.895238095238096,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ]
            },
            {
                "id": "sc_DJMAmfRBXkI",
                "shortcode": "DJMAmfRBXkI",
                "caption": "What better day than ‘International Leopard Day’ to share one of my favourite photographs so far from my Central Highlands project?  We are in our second year of documenting the life of this resident Male, Arnold (@wwctsrilanka ) and his exploits in a remote corner of Sri Lanka’s mountain ranges. Here, Arnold appears on a full-moon night striding out of his daytime safe space of the nearby Peak Wilderness Sanctuary. Moonlight pours over the side of the cliff, illuminating his powerful stride as he begins his patrol into his shared territory with humans. \n\nAs apex predators, leopards play a crucial role in maintaining the balance of our ecosystems here on the island, ensuring the health and diversity of wildlife surrounding us, whether that’s inside or outside of Protected Areas.\n\nHowever, with increasing threats from habitat destruction, poaching, and human-wildlife conflict, this national treasure needs our utmost care and protection now more than ever. Conservation efforts are vital to safeguard their future and the rich biodiversity they represent.\n\nThrough our work, we aim to shine a light on these enigmatic animals, raising awareness and fostering a spirit of coexistence between leopards and the communities that share their spaces. Together, we can create a future where these beautiful creatures roam freely in our jungles and in close proximity to humans, all the while, inspiring generations to respect and protect our natural heritage.\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 1099,
                "comments_count": 17,
                "timestamp": "2025-05-03T10:13:23.000Z",
                "display_url": "https://instagram.ftpa1-1.fna.fbcdn.net/v/t51.2885-15/495700179_18482335195071717_6377775721512576279_n.jpg?stp=dst-jpg_e35_s1080x1080_sh0.08_tt6&_nc_ht=instagram.ftpa1-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QHxA9QRfdy5r715cgtInvI-DYTyXtQ5IHc1VQ_yfwXseWl6lbq90HhSZrg_dd6wExyMIi9MuFi88yxsRlZSJ98k&_nc_ohc=aa9Sh4xNITYQ7kNvwGXD8No&_nc_gid=jMNgBAQZlIwanfCMubcsmw&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfIGFRVVF01Cgj1wEraoo1iMantnu1czGKIb00qb_HqUtg&oe=68209D90&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DJMAmfRBXkI.jpg",
                "engagement_rate": 21.257142857142856,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ],
                "mentions": [
                    "wwctsrilanka"
                ]
            },
            {
                "id": "sc_DC3ELL_ojxn",
                "shortcode": "DC3ELL_ojxn",
                "caption": "It’s almost that time of year again to head back to some of my favourite parts of the island and I couldn’t help but share perhaps what I am most looking forward to.\n\nPictured here is a mating pair (Arnold) amid the tea fields of the Central Highlands, performing their courting rituals, centre frame. Not only is this an extremely lucky image, (as they have a whole mountain to choose from to perform this exchange) but it is also especially exciting as there could now be cubs roaming these particular tea slopes.\n\nThis image was taken earlier this year in March - assuming a successful pairing and with a gestation period of roughly 3 months, (and with a little more luck) we may be able to document this next generation, further recording Arnold’s success story as he fathers offspring outside of a Protected Area and in a human-dominated landscape! \n\nStay tuned for updates. #yaniktissera",
                "likes_count": 869,
                "comments_count": 35,
                "timestamp": "2024-11-27T03:52:12.000Z",
                "display_url": "https://scontent-lga3-2.cdninstagram.com/v/t51.2885-15/468426136_18453828232071717_3439523473262338171_n.jpg?stp=dst-jpg_e35_s1080x1080_sh0.08_tt6&_nc_ht=scontent-lga3-2.cdninstagram.com&_nc_cat=109&_nc_oc=Q6cZ2QHmp2MH2v4OgnEgqsmmxBt5XUaMDyzPGtiCbWRfMIfyu6NX8zYvDymprchNRYbf0X_Lz-flKBw3z2thVczUmcxV&_nc_ohc=5YPmjS2Rh3kQ7kNvwGJH0aq&_nc_gid=tgGbQSfk03G6Hj8RYv12iw&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfKvYcLXria1n_sW2xCJvfQ6R6W861RIRLEg94SvCvefxw&oe=6820BF24&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DC3ELL_ojxn.jpg",
                "engagement_rate": 17.21904761904762,
                "hashtags": [
                    "yaniktissera"
                ]
            },
            {
                "id": "sc_DGCTWuaosgN",
                "shortcode": "DGCTWuaosgN",
                "caption": "Thanks to the epic team that accompany me on these field visits. Not only does it add so much colour having a crew with me, but the additional wo(man) power definitely goes a long way with scouting, setting up, maintenance, filming and general positive vibrations - especially when things don’t go according to plan. Watch till the end to see some results from the month of December! \n\nBig thanks always for all the hard work and encouragement - Ganesh, Kiruba, Subramani, achchi, @mikatennekoon @yhevintissera @aitanaa_g @justmclovin @crimpysnitch @tavishgunasena and Akira.\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 380,
                "comments_count": 35,
                "timestamp": "2025-02-14T02:23:59.000Z",
                "display_url": "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/477165406_1067890775142679_2376983420348157908_n.jpg?stp=dst-jpg_e15_tt6&_nc_ht=scontent-iad3-1.cdninstagram.com&_nc_cat=107&_nc_oc=Q6cZ2QF2qULFX4NI6t_V_nYnfpVw6y76WLfuSiQ4qZhbaqczQ_tiloEtWVcWWjnO0EN6TmQ&_nc_ohc=ctjJbwJGnpcQ7kNvwG9jReh&_nc_gid=UeS3Kraw9If8reUfYQlu-g&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfJryjFom_FokZQiMAMi53JwDLTQldnzgtx2Zwx8rJ01vw&oe=6820A470&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DGCTWuaosgN.jpg",
                "engagement_rate": 7.904761904761905,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ],
                "mentions": [
                    "mikatennekoon",
                    "yhevintissera",
                    "aitanaa_g",
                    "justmclovin",
                    "crimpysnitch",
                    "tavishgunasena"
                ]
            },
            {
                "id": "sc_DHfEJDsI3pq",
                "shortcode": "DHfEJDsI3pq",
                "caption": "We were so delighted when we checked the cameras this February and finally had confirmation that Arnolds late-night rendezvous was indeed a success. Eight months later and the Leopardess is now wandering a little further from the den with their two cubs in tow. \n\nEven though leopard cubs start following their mother around at an earlier age, none of our cameras picked up movement until now. Perhaps she limited the distance she travelled with the cubs from the den, or maybe in these human-dominated environments, leopard mothers choose to wait a little longer before inviting the young on longer patrols. Whatever the reason, we are so grateful to have found them and see them healthy and happy, exploring their home. \n\nWe have been monitoring the female for almost 12 months now - every time she appears in front of the cameras she doesn’t bat an eyelid, walking by confidently and ignoring the presence of the gear. However, it is very curious to see her interaction with the equipment on this occasion - she seems a little more apprehensive, and cautious of her tracks. She is obviously choosing to be extra vigilant with the cubs around, especially at these early stages of exploration and on these particular landscapes that exist outside of Protected Areas. \n\nGathering and reviewing data like this is important in this field of work, as it informs us on how we can do better and be less invasive with our approach. Photographing ethically with zero interference should be at the forefront of any wildlife photographer’s approach, whatever the technique. And so we will be making adjustments to our methods for as long as the Leopard mother needs until she builds confidence again - moving gear further back off the trail, dampening the sound of the shutter, and placing flashes at higher angles, further above the animals’ line of sight, to name a few.\n\nFollow along for more!\n\n#yaniktissera #parrotfishcollective",
                "likes_count": 682,
                "comments_count": 25,
                "timestamp": "2025-03-22T05:35:56.000Z",
                "display_url": "https://instagram.flas1-1.fna.fbcdn.net/v/t51.2885-15/485225247_18474528277071717_8813829350307871377_n.jpg?stp=dst-jpg_e15_tt6&_nc_ht=instagram.flas1-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QFFYigdHL7-lEs5zci1bbNZ0vBNFvNvh2D7Nslrl-RQCbRW0wmSvqChB1bAIUkJ5PuvgimG5pJHvR2lQCfoBEqr&_nc_ohc=89npc1gKjFUQ7kNvwGB5sPq&_nc_gid=RfwpVr3Uk_rtQYMe_gaW4A&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfLQ2EePoaPGh9H-Hpltp-1l1W5vDpPFr7RJ5L3wRAd0Mw&oe=68208F1A&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DHfEJDsI3pq.jpg",
                "engagement_rate": 13.466666666666665,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ]
            },
            {
                "id": "sc_DEq4caJoP5t",
                "shortcode": "DEq4caJoP5t",
                "caption": "On our recent field visit to gather data from our trail cameras, we were able to piece together a small snapshot of the month, featuring Arnold (@wwctsrilanka), a resident male leopard, as he patrols his expansive territory in the picturesque highlands of Sri Lanka. \n\nAs a solitary individual, Arnold conducts his nightly patrols which cover a range of habitats, including dense forests and tea filled slopes. Observing his confidence in the way he moves, you can see him navigate with authority and stealth, always on the lookout for potential invaders or prey.\n\nOne of the most critical aspects of a male leopard’s territory is its scent marking. Watch as Arnold employs various methods to communicate with other leopards. \n\n1. Leopards scratch trees and the ground, leaving visual signals and depositing pheromones through glands in their paws. This communicates their presence to others, asserting dominance and warding off rivals, reducing the chances of conflict.\n2. By urinating on bushes and grass, Leopards leave potent scent marks laden with information about gender, identity, and reproductive status. This ensures that any passing female or competing male gets the message!\n3. Leopards occasionally deposit feces in strategic locations. This not only serves as a territorial declaration but also provides dietary cues for other leopards, informing them of an individual’s health and presence through scent. \n\nFollow along to see what other data and imagery were made in the month of December! \n\n#yaniktissera #parrotfishcollective",
                "likes_count": 566,
                "comments_count": 18,
                "timestamp": "2025-01-11T03:25:59.000Z",
                "display_url": "https://scontent-phx1-1.cdninstagram.com/v/t51.2885-15/472592127_922661062974902_1573324488061842349_n.jpg?stp=dst-jpg_e15_tt6&_nc_ht=scontent-phx1-1.cdninstagram.com&_nc_cat=102&_nc_oc=Q6cZ2QGBGSraib6a8M5kRArQGRUk7n8Y9j9pP4FIlH0MeFgswMqALP8aMaN7mcYQm3gT02O05ExXiHjUZM_olQeB18E4&_nc_ohc=AlqTO96t9O8Q7kNvwEy28CV&_nc_gid=icDRy-uIFTU_g53E8MyTLg&edm=APs17CUBAAAA&ccb=7-5&oh=00_AfIFsePphUeICg4YlYOLn-YKpuMYkrJhHZEAUDI4SUyJlg&oe=6820A8F1&_nc_sid=10d13b",
                "is_video": false,
                "image_local": "images/user_4/posts/sc_DEq4caJoP5t.jpg",
                "engagement_rate": 11.123809523809523,
                "hashtags": [
                    "yaniktissera",
                    "parrotfishcollective"
                ],
                "mentions": [
                    "wwctsrilanka,"
                ]
            }
        ],
        "profile_pic_local": "images/user_4/profiles/yaniktissera.jpg",
        "likes_total": 8357,
        "comments_total": 333,
        "total_engagement": 8690,
        "avg_likes": 835.7,
        "avg_comments": 33.3,
        "engagement_rate": 16.55238095238095,
        "avg_engagement_rate": 16.55238095238095,
        "max_engagement_rate": 53.98095238095239,
        "top_hashtags": [
            {
                "tag": "yaniktissera",
                "count": 10
            },
            {
                "tag": "parrotfishcollective",
                "count": 7
            }
        ],
        "top_mentions": [
            {
                "username": "wwctsrilanka",
                "count": 1
            },
            {
                "username": "mikatennekoon",
                "count": 1
            },
            {
                "username": "yhevintissera",
                "count": 1
            },
            {
                "username": "aitanaa_g",
                "count": 1
            },
            {
                "username": "justmclovin",
                "count": 1
            },
            {
                "username": "crimpysnitch",
                "count": 1
            },
            {
                "username": "tavishgunasena",
                "count": 1
            },
            {
                "username": "wwctsrilanka,",
                "count": 1
            }
        ],
        "all_captions": "Every four to six weeks, we return to the cameras high up in the mountains to check what images may have been made. At times, we get unlucky; equipment malfunctions, adverse weather, dead batteries, curious monkeys, and ravenous ants are just a few of the persistent troubles to be dealt with. Most of the time there is an image to salvage, however, all of the time, the adventures to these landscapes make up for the occasional disappointment. \n\nIn this video, I set up and retrieve a recent shot aimed at situating wildlife against a recognisable mountainscape. There is never a shortage of surprises as various creatures and beautiful landscapes present themselves anew at every visit. \n\nWatch till the end for a sneak peek of some results!\n\n#yaniktissera #parrotfishcollective\n\nWith the last remaining sub-montane and montane rainforests and one of the world’s richest concentrations of biodiversity that include an extremely high number of endemic species (many of which are site-endemic), the Central Highlands of Sri Lanka are truly a special place and as such represented in the UNESCO World Heritage List. \n\nDuring the drier months of the year (January - March), Sri Lanka’s mountain region is at high risk of fires. Determined by low humidity, topography and wind patterns during the short fire season of the wet zone, fires pose a danger to the mountain regions that are already vulnerable to climate change and environmental degradation. \n\nIt is the Eucalyptus, pine forests and grasslands that are especially prone, with many of these trees located on (inaccessible) steep slopes adjacent to tea estates, and the forest patches that are of significant importance. \n\nEven though the Central and Uva provinces are classified as having a “low fire risk”, raging fires and plumes of smoke rising from the sides of cliff faces are a common occurrence during the drier periods, always threatening pristine wilderness spaces close by. \n\nPictured here, a waterfall cascades into the Maussakelle reservoir as a wildfire burns at the bottom of a tea estate, sending clouds of smoke into the air against the backdrop of Sri Pada and the Peak Wilderness Sanctuary in the distance. \n\n#yaniktissera\n\nA self-portrait with a few visitors at our last location - these types of images are always a bonus for me if the particular photograph that was envisioned doesn’t work out. (It did). \n\nAs the camera records multiple moments over time, we are able to creatively piece together a surreal image, showcasing shared spaces of numerous species. \n\nWhat’s particularly special about this one is the little Leopard on the left. He/She is one of Arnold’s cubs. For those of you who have been following along - we found them! \n\nTwo healthy little cubs roughly 8 months old are now roaming around with their mother as she teaches them how to navigate this tricky environment against the iconic backdrop of the Sri Pada mountainscape; each species in this image fair game (except me), as the cubs learn the ways of an apex predator.\n\nThis image was made by combining 7 images taken over a period of 6 weeks. The species seen here include the Black-naped hare, Rusty-spotted cat, Indian crested porcupine, Ring-tailed civet, and Sri Lankan leopard. \n\nFollow along to see footage of those cubs, soon!\n\n#yaniktissera #parrotfishcollective\n\nMountainscapes in silver.\n\nSunlight pierces through a gentle fog early one morning in the mountains of Sri Lanka. First light illuminates tea slopes whilst townships stir quietly in the shadow of the valleys. \n\n#yaniktissera\n\nA sacred mountain \nLit at its peak\nAwaiting pilgrims\nAnswers they seek\n\nA journey made\nTo concur terrain\nSpiritual growth\nOne seeks to attain \n\nA sacred footprint \nLeft after dark \nOut of sight \nI leave my mark\n\nDays before Sri Pada (Adams Peak) was declared open for the season, a leopard strolled past my camera. There was an error in my understanding - the mountain weather only becomes favourable after the full moon of December (which also marks the opening of the Sri Pada season). What was I doing trying to tick off a previsualised shot at the wrong month of the year? \n\nI was aware of the opportunities to capture iconic images in the highlands - ones that are unique and showcase the co-existence of humans and leopards in the central highlands of Sri Lanka, despite the issue of snaring. Whilst humans navigate these landscapes during the day, the islands’ terrestrial apex predators comfortably traverse the same paths after dark. \n\nI may not have captured the perfect image, but I am glad to have ticked off one from my growing list of images that will help tell this story. No doubt it is particularly rewarding considering what a beautifully clear night it was when this individual decided to come by, and despite all the odds, I am proud to have made an image of a Leopard with the Sri Pada mountainscape alight as the backdrop.\n\n#yaniktissera #parrotfishcollective\n\nWhat better day than ‘International Leopard Day’ to share one of my favourite photographs so far from my Central Highlands project?  We are in our second year of documenting the life of this resident Male, Arnold (@wwctsrilanka ) and his exploits in a remote corner of Sri Lanka’s mountain ranges. Here, Arnold appears on a full-moon night striding out of his daytime safe space of the nearby Peak Wilderness Sanctuary. Moonlight pours over the side of the cliff, illuminating his powerful stride as he begins his patrol into his shared territory with humans. \n\nAs apex predators, leopards play a crucial role in maintaining the balance of our ecosystems here on the island, ensuring the health and diversity of wildlife surrounding us, whether that’s inside or outside of Protected Areas.\n\nHowever, with increasing threats from habitat destruction, poaching, and human-wildlife conflict, this national treasure needs our utmost care and protection now more than ever. Conservation efforts are vital to safeguard their future and the rich biodiversity they represent.\n\nThrough our work, we aim to shine a light on these enigmatic animals, raising awareness and fostering a spirit of coexistence between leopards and the communities that share their spaces. Together, we can create a future where these beautiful creatures roam freely in our jungles and in close proximity to humans, all the while, inspiring generations to respect and protect our natural heritage.\n\n#yaniktissera #parrotfishcollective\n\nIt’s almost that time of year again to head back to some of my favourite parts of the island and I couldn’t help but share perhaps what I am most looking forward to.\n\nPictured here is a mating pair (Arnold) amid the tea fields of the Central Highlands, performing their courting rituals, centre frame. Not only is this an extremely lucky image, (as they have a whole mountain to choose from to perform this exchange) but it is also especially exciting as there could now be cubs roaming these particular tea slopes.\n\nThis image was taken earlier this year in March - assuming a successful pairing and with a gestation period of roughly 3 months, (and with a little more luck) we may be able to document this next generation, further recording Arnold’s success story as he fathers offspring outside of a Protected Area and in a human-dominated landscape! \n\nStay tuned for updates. #yaniktissera\n\nThanks to the epic team that accompany me on these field visits. Not only does it add so much colour having a crew with me, but the additional wo(man) power definitely goes a long way with scouting, setting up, maintenance, filming and general positive vibrations - especially when things don’t go according to plan. Watch till the end to see some results from the month of December! \n\nBig thanks always for all the hard work and encouragement - Ganesh, Kiruba, Subramani, achchi, @mikatennekoon @yhevintissera @aitanaa_g @justmclovin @crimpysnitch @tavishgunasena and Akira.\n\n#yaniktissera #parrotfishcollective\n\nWe were so delighted when we checked the cameras this February and finally had confirmation that Arnolds late-night rendezvous was indeed a success. Eight months later and the Leopardess is now wandering a little further from the den with their two cubs in tow. \n\nEven though leopard cubs start following their mother around at an earlier age, none of our cameras picked up movement until now. Perhaps she limited the distance she travelled with the cubs from the den, or maybe in these human-dominated environments, leopard mothers choose to wait a little longer before inviting the young on longer patrols. Whatever the reason, we are so grateful to have found them and see them healthy and happy, exploring their home. \n\nWe have been monitoring the female for almost 12 months now - every time she appears in front of the cameras she doesn’t bat an eyelid, walking by confidently and ignoring the presence of the gear. However, it is very curious to see her interaction with the equipment on this occasion - she seems a little more apprehensive, and cautious of her tracks. She is obviously choosing to be extra vigilant with the cubs around, especially at these early stages of exploration and on these particular landscapes that exist outside of Protected Areas. \n\nGathering and reviewing data like this is important in this field of work, as it informs us on how we can do better and be less invasive with our approach. Photographing ethically with zero interference should be at the forefront of any wildlife photographer’s approach, whatever the technique. And so we will be making adjustments to our methods for as long as the Leopard mother needs until she builds confidence again - moving gear further back off the trail, dampening the sound of the shutter, and placing flashes at higher angles, further above the animals’ line of sight, to name a few.\n\nFollow along for more!\n\n#yaniktissera #parrotfishcollective\n\nOn our recent field visit to gather data from our trail cameras, we were able to piece together a small snapshot of the month, featuring Arnold (@wwctsrilanka), a resident male leopard, as he patrols his expansive territory in the picturesque highlands of Sri Lanka. \n\nAs a solitary individual, Arnold conducts his nightly patrols which cover a range of habitats, including dense forests and tea filled slopes. Observing his confidence in the way he moves, you can see him navigate with authority and stealth, always on the lookout for potential invaders or prey.\n\nOne of the most critical aspects of a male leopard’s territory is its scent marking. Watch as Arnold employs various methods to communicate with other leopards. \n\n1. Leopards scratch trees and the ground, leaving visual signals and depositing pheromones through glands in their paws. This communicates their presence to others, asserting dominance and warding off rivals, reducing the chances of conflict.\n2. By urinating on bushes and grass, Leopards leave potent scent marks laden with information about gender, identity, and reproductive status. This ensures that any passing female or competing male gets the message!\n3. Leopards occasionally deposit feces in strategic locations. This not only serves as a territorial declaration but also provides dietary cues for other leopards, informing them of an individual’s health and presence through scent. \n\nFollow along to see what other data and imagery were made in the month of December! \n\n#yaniktissera #parrotfishcollective\n\n",
        "engagement_weekly": [
            {
                "date": "2024-01-28",
                "likes": 1330,
                "comments": 82,
                "engagement": 1412,
                "engagement_rate": 26.895238095238096
            },
            {
                "date": "2024-02-04",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-02-11",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-02-18",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-02-25",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03-03",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03-10",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03-17",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03-24",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03-31",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-04-07",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-04-14",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-04-21",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-04-28",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-05-05",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-05-12",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-05-19",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-05-26",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06-02",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06-09",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06-16",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06-23",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06-30",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-07-07",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-07-14",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-07-21",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-07-28",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-08-04",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-08-11",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-08-18",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-08-25",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09-01",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09-08",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09-15",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09-22",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09-29",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-10-06",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-10-13",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-10-20",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-10-27",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-11-03",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-11-10",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-11-17",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-11-24",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-12-01",
                "likes": 1089,
                "comments": 38,
                "engagement": 1127,
                "engagement_rate": 21.46666666666667
            },
            {
                "date": "2024-12-08",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-12-15",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-12-22",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-12-29",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-01-05",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-01-12",
                "likes": 566,
                "comments": 18,
                "engagement": 584,
                "engagement_rate": 11.123809523809523
            },
            {
                "date": "2025-01-19",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-01-26",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-02-02",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-02-09",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-02-16",
                "likes": 380,
                "comments": 35,
                "engagement": 415,
                "engagement_rate": 7.904761904761905
            },
            {
                "date": "2025-02-23",
                "likes": 2745,
                "comments": 89,
                "engagement": 2834,
                "engagement_rate": 53.98095238095239
            },
            {
                "date": "2025-03-02",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-03-09",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-03-16",
                "likes": 466,
                "comments": 29,
                "engagement": 495,
                "engagement_rate": 9.428571428571429
            },
            {
                "date": "2025-03-23",
                "likes": 682,
                "comments": 25,
                "engagement": 707,
                "engagement_rate": 13.466666666666665
            },
            {
                "date": "2025-03-30",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-04-06",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-04-13",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-04-20",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-04-27",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-05-04",
                "likes": 1099,
                "comments": 17,
                "engagement": 1116,
                "engagement_rate": 21.257142857142856
            }
        ],
        "engagement_monthly": [
            {
                "date": "2024-01",
                "likes": 1330,
                "comments": 82,
                "engagement": 1412,
                "engagement_rate": 26.895238095238096
            },
            {
                "date": "2024-02",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-03",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-04",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-05",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-06",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-07",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-08",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-09",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-10",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-11",
                "likes": 1089,
                "comments": 38,
                "engagement": 1127,
                "engagement_rate": 21.46666666666667
            },
            {
                "date": "2024-12",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-01",
                "likes": 566,
                "comments": 18,
                "engagement": 584,
                "engagement_rate": 11.123809523809523
            },
            {
                "date": "2025-02",
                "likes": 3125,
                "comments": 124,
                "engagement": 3249,
                "engagement_rate": 61.885714285714286
            },
            {
                "date": "2025-03",
                "likes": 1148,
                "comments": 54,
                "engagement": 1202,
                "engagement_rate": 22.895238095238096
            },
            {
                "date": "2025-04",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2025-05",
                "likes": 1099,
                "comments": 17,
                "engagement": 1116,
                "engagement_rate": 21.257142857142856
            }
        ],
        "engagement_quarterly": [
            {
                "date": "2024-Qq",
                "likes": 1330,
                "comments": 82,
                "engagement": 1412,
                "engagement_rate": 26.895238095238096
            },
            {
                "date": "2024-Qq",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-Qq",
                "likes": 0,
                "comments": 0,
                "engagement": 0,
                "engagement_rate": 0.0
            },
            {
                "date": "2024-Qq",
                "likes": 1089,
                "comments": 38,
                "engagement": 1127,
                "engagement_rate": 21.46666666666667
            },
            {
                "date": "2025-Qq",
                "likes": 4839,
                "comments": 196,
                "engagement": 5035,
                "engagement_rate": 95.9047619047619
            },
            {
                "date": "2025-Qq",
                "likes": 1099,
                "comments": 17,
                "engagement": 1116,
                "engagement_rate": 21.257142857142856
            }
        ]
    }
}